package com.kitview.admin.controller;

import com.google.gson.Gson;
import org.springframework.stereotype.Controller;
import org.springframework.web.bind.annotation.RequestBody;
import org.springframework.web.bind.annotation.RequestMapping;
import org.springframework.web.bind.annotation.RequestMethod;
import org.springframework.web.bind.annotation.ResponseBody;

@Controller
public class KitViewController {
    @ResponseBody()
    @RequestMapping(value = "/getHoliday",method = RequestMethod.GET  , produces = "application/json;charset=UTF-8")
    public String getHoliday(){
        return "[\n" +
                "    {\n" +
                "        \"fileName\":\"2018_holiday.json\",\n" +
                "        \"data\":{\n" +
                "            \"1001\":\"国庆节\",\n" +
                "            \"1002\":\"国庆节\",\n" +
                "            \"1003\":\"国庆节\",\n" +
                "            \"1004\":\"国庆节\",\n" +
                "            \"1005\":\"国庆节\",\n" +
                "            \"1006\":\"国庆节\",\n" +
                "            \"1007\":\"国庆节\",\n" +
                "            \"0101\":\"元旦\",\n" +
                "            \"0211\":\"w春节\",\n" +
                "            \"0215\":\"春节\",\n" +
                "            \"0216\":\"春节\",\n" +
                "            \"0217\":\"春节\",\n" +
                "            \"0218\":\"春节\",\n" +
                "            \"0219\":\"春节\",\n" +
                "            \"0220\":\"春节\",\n" +
                "            \"0221\":\"春节\",\n" +
                "            \"0224\":\"w春节\",\n" +
                "            \"0405\":\"清明节\",\n" +
                "            \"0406\":\"清明节\",\n" +
                "            \"0407\":\"清明节\",\n" +
                "            \"0408\":\"w清明节\",\n" +
                "            \"0428\":\"w劳动节\",\n" +
                "            \"0429\":\"劳动节\",\n" +
                "            \"0430\":\"劳动节\",\n" +
                "            \"0501\":\"劳动节\",\n" +
                "            \"0616\":\"端午节\",\n" +
                "            \"0617\":\"端午节\",\n" +
                "            \"0618\":\"端午节\",\n" +
                "            \"0922\":\"中秋节\",\n" +
                "            \"0923\":\"中秋节\",\n" +
                "            \"0924\":\"中秋节\",\n" +
                "            \"0929\":\"w国庆节\",\n" +
                "            \"0930\":\"w国庆节\"\n" +
                "        }\n" +
                "    },\n" +
                "    {\n" +
                "        \"fileName\":\"2019_holiday.json\",\n" +
                "        \"data\":{\n" +
                "            \"1001\":\"国庆节\",\n" +
                "            \"1002\":\"国庆节\",\n" +
                "            \"1003\":\"国庆节\",\n" +
                "            \"1004\":\"国庆节\",\n" +
                "            \"1005\":\"国庆节\",\n" +
                "            \"1006\":\"国庆节\",\n" +
                "            \"1007\":\"国庆节\",\n" +
                "            \"0101\":\"元旦\",\n" +
                "            \"0211\":\"w春节\",\n" +
                "            \"0215\":\"春节\",\n" +
                "            \"0216\":\"春节\",\n" +
                "            \"0217\":\"春节\",\n" +
                "            \"0218\":\"春节\",\n" +
                "            \"0219\":\"春节\",\n" +
                "            \"0220\":\"春节\",\n" +
                "            \"0221\":\"春节\",\n" +
                "            \"0224\":\"w春节\",\n" +
                "            \"0405\":\"清明节\",\n" +
                "            \"0406\":\"清明节\",\n" +
                "            \"0407\":\"清明节\",\n" +
                "            \"0408\":\"w清明节\",\n" +
                "            \"0428\":\"w劳动节\",\n" +
                "            \"0429\":\"劳动节\",\n" +
                "            \"0430\":\"劳动节\",\n" +
                "            \"0501\":\"劳动节\",\n" +
                "            \"0616\":\"端午节\",\n" +
                "            \"0617\":\"端午节\",\n" +
                "            \"0618\":\"端午节\",\n" +
                "            \"0922\":\"中秋节\",\n" +
                "            \"0923\":\"中秋节\",\n" +
                "            \"0924\":\"中秋节\",\n" +
                "            \"0929\":\"w国庆节\",\n" +
                "            \"0930\":\"w国庆节\"\n" +
                "        }\n" +
                "    }\n" +
                "]";
    }
}
