package com.kitview.admin.controller;

import com.google.gson.Gson;
import org.springframework.stereotype.Controller;
import org.springframework.web.bind.annotation.RequestBody;
import org.springframework.web.bind.annotation.RequestMapping;
import org.springframework.web.bind.annotation.RequestMethod;
import org.springframework.web.bind.annotation.ResponseBody;

@Controller
public class KitViewController {
    @ResponseBody()
    @RequestMapping(value = "/getHoliday",method = RequestMethod.GET  , produces = "application/json;charset=UTF-8")
    public String getHoliday(){
        //w开头的表示上班日，日历上显示一个“班”字，其他是休息日，日历上显示是“休”字
        return "[\n" +
                "    {\n" +
                "        \"fileName\":\"2020_holiday.json\",\n" +
                "        \"data\":{\n" +
                "            \"1001\":\"国庆节,中秋节\",\n" +
                "            \"1002\":\"国庆节,中秋节\",\n" +
                "            \"1003\":\"国庆节,中秋节\",\n" +
                "            \"1004\":\"国庆节,中秋节\",\n" +
                "            \"1005\":\"国庆节,中秋节\",\n" +
                "            \"1006\":\"国庆节,中秋节\",\n" +
                "            \"1007\":\"国庆节,中秋节\",\n" +
                "            \"1008\":\"国庆节,中秋节\",\n" +
                "            \"1010\":\"w国庆节,w中秋节\",\n" +
                "            \"0101\":\"元旦\",\n" +
                "            \"0119\":\"w春节\",\n" +
                "            \"0124\":\"春节\",\n" +
                "            \"0125\":\"春节\",\n" +
                "            \"0126\":\"春节\",\n" +
                "            \"0127\":\"春节\",\n" +
                "            \"0128\":\"春节\",\n" +
                "            \"0129\":\"春节\",\n" +
                "            \"0130\":\"春节\",\n" +
                "            \"0201\":\"w春节\",\n" +
                "            \"0404\":\"清明节\",\n" +
                "            \"0405\":\"清明节\",\n" +
                "            \"0406\":\"清明节\",\n" +
                "            \"0426\":\"w劳动节\",\n" +
                "            \"0501\":\"劳动节\",\n" +
                "            \"0502\":\"劳动节\",\n" +
                "            \"0503\":\"劳动节\",\n" +
                "            \"0504\":\"劳动节\",\n" +
                "            \"0505\":\"劳动节\",\n" +
                "            \"0509\":\"w劳动节\",\n" +
                "            \"0625\":\"端午节\",\n" +
                "            \"0626\":\"端午节\",\n" +
                "            \"0627\":\"端午节\",\n" +
                "            \"0628\":\"w端午节\",\n" +
                "            \"0927\":\"w国庆节,w中秋节\"\n" +
                "        }\n" +
                "    },\n" +
                "    {\n" +
                "        \"fileName\":\"2019_holiday.json\",\n" +
                "        \"data\":{\n" +
                "            \"1001\":\"国庆节\",\n" +
                "            \"1002\":\"国庆节\",\n" +
                "            \"1003\":\"国庆节\",\n" +
                "            \"1004\":\"国庆节\",\n" +
                "            \"1005\":\"国庆节\",\n" +
                "            \"1006\":\"国庆节\",\n" +
                "            \"1007\":\"国庆节\",\n" +
                "            \"1012\":\"国庆节\",\n" +
                "            \"0101\":\"元旦\",\n" +
                "            \"0202\":\"w春节\",\n" +
                "            \"0203\":\"w春节\",\n" +
                "            \"0204\":\"春节\",\n" +
                "            \"0205\":\"春节\",\n" +
                "            \"0206\":\"春节\",\n" +
                "            \"0207\":\"春节\",\n" +
                "            \"0208\":\"春节\",\n" +
                "            \"0209\":\"春节\",\n" +
                "            \"0210\":\"春节\",\n" +
                "            \"0405\":\"清明节\",\n" +
                "            \"0406\":\"清明节\",\n" +
                "            \"0407\":\"清明节\",\n" +
                "            \"0428\":\"w劳动节\",\n" +
                "            \"0501\":\"劳动节\",\n" +
                "            \"0502\":\"劳动节\",\n" +
                "            \"0503\":\"劳动节\",\n" +
                "            \"0504\":\"劳动节\",\n" +
                "            \"0505\":\"w劳动节\",\n" +
                "            \"0607\":\"端午节\",\n" +
                "            \"0608\":\"端午节\",\n" +
                "            \"0609\":\"端午节\",\n" +
                "            \"0913\":\"中秋节\",\n" +
                "            \"0914\":\"中秋节\",\n" +
                "            \"0915\":\"中秋节\",\n" +
                "            \"0929\":\"w国庆节\"\n" +
                "        }\n" +
                "    },\n" +
                "    {\n" +
                "        \"fileName\":\"2018_holiday.json\",\n" +
                "        \"data\":{\n" +
                "            \"1001\":\"国庆节\",\n" +
                "            \"1002\":\"国庆节\",\n" +
                "            \"1003\":\"国庆节\",\n" +
                "            \"1004\":\"国庆节\",\n" +
                "            \"1005\":\"国庆节\",\n" +
                "            \"1006\":\"国庆节\",\n" +
                "            \"1007\":\"国庆节\",\n" +
                "            \"0101\":\"元旦\",\n" +
                "            \"0211\":\"w春节\",\n" +
                "            \"0215\":\"春节\",\n" +
                "            \"0216\":\"春节\",\n" +
                "            \"0217\":\"春节\",\n" +
                "            \"0218\":\"春节\",\n" +
                "            \"0219\":\"春节\",\n" +
                "            \"0220\":\"春节\",\n" +
                "            \"0221\":\"春节\",\n" +
                "            \"0224\":\"w春节\",\n" +
                "            \"0405\":\"清明节\",\n" +
                "            \"0406\":\"清明节\",\n" +
                "            \"0407\":\"清明节\",\n" +
                "            \"0408\":\"w清明节\",\n" +
                "            \"0428\":\"w劳动节\",\n" +
                "            \"0429\":\"劳动节\",\n" +
                "            \"0430\":\"劳动节\",\n" +
                "            \"0501\":\"劳动节\",\n" +
                "            \"0616\":\"端午节\",\n" +
                "            \"0617\":\"端午节\",\n" +
                "            \"0618\":\"端午节\",\n" +
                "            \"0922\":\"中秋节\",\n" +
                "            \"0923\":\"中秋节\",\n" +
                "            \"0924\":\"中秋节\",\n" +
                "            \"0929\":\"w国庆节\",\n" +
                "            \"0930\":\"w国庆节\"\n" +
                "        }\n" +
                "    }\n" +
                "]";
    }

    @ResponseBody()
    @RequestMapping(value = "/getFestival")
    public String getFestival(){
        //H开头表示比较出名的节日，在日历上将会显示的节日；N开头表示农历节日，优先级最高；L开头表示存在的节日，当时并不出名，日历上不会显示，但会记录在客户端的dateInfo里面
        return "{\n" +
                "  \"H0101\": \"元旦\",\n" +
                "  \"N1208\": \"腊八节\",\n" +
                "  \"N1223\": \"小年\",\n" +
                "  \"L0124\": \"国际麻风节\",\n" +
                "  \"N0101\": \"春节\",\n" +
                "  \"L0126\": \"国际海关日\",\n" +
                "\n" +
                "  \"L0202\": \"世界湿地日\",\n" +
                "  \"L0207\": \"国际声援南非日\",\n" +
                "  \"L0210\": \"国际气象节\",\n" +
                "  \"N0115\": \"元宵节\",\n" +
                "  \"H0214\": \"情人节\",\n" +
                "  \"L0224\": \"第三世界青年日\",\n" +
                "  \"N0202\": \"龙抬头\",\n" +
                "  \"L0204\": \"世界抗癌日\",\n" +
                "  \"L0221\": \"国际母语日\",\n" +
                "  \"L0229\": \"国际罕见病日\",\n" +
                "\n" +
                "  \"L0301\": \"国际海豹日\",\n" +
                "  \"L0303\": \"国际爱耳日\",\n" +
                "  \"L0305\": \"学雷锋纪念日\",\n" +
                "  \"H0308\": \"妇女节\",\n" +
                "  \"H0312\": \"植树节\",\n" +
                "  \"H0314\": \"白色情人节\",\n" +
                "  \"L0308\": \"消费者权益日\",\n" +
                "  \"L0317\": \"国际航海日\",\n" +
                "  \"L0320\": \"世界无肉日\",\n" +
                "  \"L0322\": \"世界水日\",\n" +
                "  \"L0323\": \"世界气象日\",\n" +
                "  \"L0311\": \"国际尊严尊敬日\",\n" +
                "  \"L0314\": \"国际警察日\",\n" +
                "  \"L0321\": \"世界森林日,世界儿歌日,世界睡眠日\",\n" +
                "  \"L0324\": \"世界防治结核病日\",\n" +
                "\n" +
                "  \"L0410\": \"耶稣受难日\",\n" +
                "  \"H0401\": \"愚人节\",\n" +
                "  \"L0402\": \"国际儿童图书日\",\n" +
                "  \"N0311\": \"寒食节\",\n" +
                "  \"L0407\": \"世界卫生日\",\n" +
                "  \"L0411\": \"世界帕金森病日\",\n" +
                "  \"L0422\": \"世界地球日\",\n" +
                "  \"L0423\": \"世界读书日\",\n" +
                "  \"L0426\": \"世界知识产权日\",\n" +
                "  \"L0412\": \"复活节\",\n" +
                "\n" +
                "  \"H0501\": \"劳动节-五一国际劳动节\",\n" +
                "  \"L0504\": \"中国青年节\",\n" +
                "  \"L0505\": \"世界哮喘日\",\n" +
                "  \"L0508\": \"世界红十字日\",\n" +
                "  \"L0512\": \"国际护士节\",\n" +
                "  \"H0513\": \"母亲节\",\n" +
                "  \"L0515\": \"国际家庭日,防治碘缺乏病日\",\n" +
                "  \"L0518\": \"世界博物馆日\",\n" +
                "  \"L0517\": \"世界助残日,世界电信日\",\n" +
                "  \"L0520\": \"全国学生营养日,全国母乳喂养宣传日\",\n" +
                "  \"L0522\": \"国际生物多样性日\",\n" +
                "  \"L0531\": \"世界无烟日\",\n" +
                "\n" +
                "  \"L0606\": \"全国爱眼日\",\n" +
                "  \"H0601\": \"儿童节-国际儿童节\",\n" +
                "  \"L0605\": \"世界环境日\",\n" +
                "  \"L0613\": \"中国文化遗产日\",\n" +
                "  \"N0505\": \"端午节\",\n" +
                "  \"H0621\": \"父亲节\",\n" +
                "  \"L0620\": \"世界难民日\",\n" +
                "  \"L0623\": \"国际奥林匹克日\",\n" +
                "  \"L0625\": \"全国土地日\",\n" +
                "  \"L0626\": \"世界禁毒日,联合国宪章日\",\n" +
                "\n" +
                "  \"L0701\": \"香港回归纪念日\",\n" +
                "  \"L0704\": \"国际合作节\",\n" +
                "  \"H0701\": \"建党节\",\n" +
                "  \"L0711\": \"世界人口日\",\n" +
                "\n" +
                "  \"H0801\": \"八一建军节\",\n" +
                "  \"N0707\": \"七夕情人节\",\n" +
                "  \"N0715\": \"中元节\",\n" +
                "  \"L0908\": \"国际扫盲日\",\n" +
                "  \"H0910\": \"教师节\",\n" +
                "  \"L0910\":\"世界预防自杀日\",\n" +
                "  \"L0916\": \"国际臭氧层保护日\",\n" +
                "  \"L0918\": \"中国国耻日\",\n" +
                "  \"L0920\": \"国际爱牙日\",\n" +
                "  \"L0921\": \"国际和平日\",\n" +
                "  \"L0927\": \"国际聋人日,世界旅游日\",\n" +
                "\n" +
                "  \"N0815\": \"中秋节\",\n" +
                "  \"H1001\":\"国庆节\",\n" +
                "  \"L1001\": \"国际音乐日\",\n" +
                "  \"L1004\": \"世界动物日\",\n" +
                "  \"L1005\": \"世界住房日\",\n" +
                "  \"L1008\": \"世界视觉日,世界高血压日\",\n" +
                "  \"L1013\": \"国际减轻自然灾害日\",\n" +
                "  \"L1009\": \"世界邮政日\",\n" +
                "  \"L1010\": \"世界精神卫生日\",\n" +
                "  \"N0909\": \"重阳节\",\n" +
                "  \"L1015\": \"国际盲人节\",\n" +
                "  \"L1016\": \"世界粮食日\",\n" +
                "  \"L1017\": \"世界消除贫困日\",\n" +
                "  \"L1022\": \"世界传统医药日\",\n" +
                "  \"L1024\": \"联合国日\",\n" +
                "  \"L1025\": \"人类天花绝迹日\",\n" +
                "\n" +
                "  \"L1101\": \"万圣节\",\n" +
                "  \"L1108\": \"中国记者日\",\n" +
                "  \"L1109\": \"消防宣传日\",\n" +
                "  \"L1111\": \"光棍节\",\n" +
                "  \"L1114\": \"联合国糖尿病日\",\n" +
                "  \"L1117\": \"国际大学生日\",\n" +
                "  \"H1126\": \"感恩节\",\n" +
                "\n" +
                "  \"L1201\": \"世界艾滋病日\",\n" +
                "  \"L1203\": \"国际残疾人日\",\n" +
                "  \"L1209\": \"世界足球日\",\n" +
                "  \"L1213\": \"南京大屠杀纪念日\",\n" +
                "  \"L1215\": \"世界强化免疫日\",\n" +
                "  \"L1220\": \"澳门回归日\",\n" +
                "  \"L1221\": \"国际篮球日\",\n" +
                "  \"N1101\": \"冬月\",\n" +
                "  \"H1224\": \"平安夜\",\n" +
                "  \"H1225\": \"圣诞节\",\n" +
                "  \"L1206\": \"毛泽东诞辰日\"\n" +
                "}";
    }
}
